Pandas Basics

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [4]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [5]:
df.tail()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [6]:
df.tail(2)

    X   Y   Z
3  80  83  72
4  86  86  83

In [7]:
df.shape()

TypeError: 'tuple' object is not callable

In [8]:
df.shape

(5, 3)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       5 non-null      int64
 1   Y       5 non-null      int64
 2   Z       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [11]:
df.describe()

          X          Y          Z
count   5.0   5.000000   5.000000
mean   85.0  87.200000  86.800000
std     7.0   4.438468  10.281051
min    78.0  83.000000  72.000000
25%    80.0  84.000000  83.000000
50%    85.0  86.000000  86.000000
75%    86.0  89.000000  96.000000
max    96.0  94.000000  97.000000

In [10]:
s.value_counts(dropna=False)

NameError: name 's' is not defined

In [12]:
df.value_counts(dropna = False)

X   Y   Z
78  84  86    1
80  83  72    1
85  94  97    1
86  86  83    1
96  89  96    1
dtype: int64

In [13]:
df.iloc()

In [14]:
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [15]:
df.iloc[:0]

Empty DataFrame
Columns: [X, Y, Z]
Index: []

In [16]:
df.iloc[0]

X    78
Y    84
Z    86
Name: 0, dtype: int64

In [17]:
df.iloc[3:4]

    X   Y   Z
3  80  83  72

In [18]:
df.iloc[3]

X    80
Y    83
Z    72
Name: 3, dtype: int64

In [22]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [23]:
df.columns = ["apple", "banana", "orange"]
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [25]:
df["banana"].mean()

87.2

In [26]:
df["banana"].min()

83

In [27]:
df["banana"].max()

94

In [28]:
df["banana"].std()

4.43846820423443

In [30]:
df["banana"].count()

5

In [33]:
df["banana"].sort_values(ascending= False)

1    94
2    89
4    86
0    84
3    83
Name: banana, dtype: int64

In [36]:
df[df["apple"] >= 72]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [37]:
df[df["banana"] <= 85]

   apple  banana  orange
0     78      84      86
3     80      83      72

In [38]:
df[df.apple >= 72]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [39]:
df[(df.orange >= 72) & (df.apple >=90)]

   apple  banana  orange
2     96      89      96

In [40]:
df["banana"] = df["banana"].replace(84, 50)
print(df)

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [43]:
df[(df.orange >= 72) or (df.orange >= 90)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [44]:
df[(df.orange >= 72) | (df.orange >= 90)]

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83